Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ1064DAR169.PIC
      <edc:SFRDef edc:_addr="0x1F860690" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATG0" edc:desc="" edc:mask="0x1" edc:name="CNSTATG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG1" edc:desc="" edc:mask="0x1" edc:name="CNSTATG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG12" edc:desc="" edc:mask="0x1" edc:name="CNSTATG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG13" edc:desc="" edc:mask="0x1" edc:name="CNSTATG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG14" edc:desc="" edc:mask="0x1" edc:name="CNSTATG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG15" edc:desc="" edc:mask="0x1" edc:name="CNSTATG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNNEG" edc:desc="" edc:impl="0xf3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="CNNEG" edc:nzwidth="32" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEG0" edc:mask="0x1" edc:name="CNNEG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG1" edc:mask="0x1" edc:name="CNNEG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEG6" edc:mask="0x1" edc:name="CNNEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG7" edc:mask="0x1" edc:name="CNNEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG8" edc:mask="0x1" edc:name="CNNEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG9" edc:mask="0x1" edc:name="CNNEG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEG12" edc:mask="0x1" edc:name="CNNEG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG13" edc:mask="0x1" edc:name="CNNEG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG14" edc:mask="0x1" edc:name="CNNEG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG15" edc:mask="0x1" edc:name="CNNEG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNFG" edc:desc="" edc:impl="0xf3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="CNFG" edc:nzwidth="32" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFG0" edc:mask="0x1" edc:name="CNFG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG1" edc:mask="0x1" edc:name="CNFG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG6" edc:mask="0x1" edc:name="CNFG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG7" edc:mask="0x1" edc:name="CNFG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG8" edc:mask="0x1" edc:name="CNFG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG9" edc:mask="0x1" edc:name="CNFG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG12" edc:mask="0x1" edc:name="CNFG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG13" edc:mask="0x1" edc:name="CNFG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG14" edc:mask="0x1" edc:name="CNFG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG15" edc:mask="0x1" edc:name="CNFG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="SRCON0G" edc:desc="" edc:impl="0xf3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="SRCON0G" edc:nzwidth="32" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0G0" edc:mask="0x1" edc:name="SR0G0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0G1" edc:mask="0x1" edc:name="SR0G1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0G6" edc:mask="0x1" edc:name="SR0G6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G7" edc:mask="0x1" edc:name="SR0G7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G8" edc:mask="0x1" edc:name="SR0G8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G9" edc:mask="0x1" edc:name="SR0G9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0G12" edc:mask="0x1" edc:name="SR0G12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G13" edc:mask="0x1" edc:name="SR0G13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G14" edc:mask="0x1" edc:name="SR0G14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G15" edc:mask="0x1" edc:name="SR0G15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="SRCON1G" edc:desc="" edc:impl="0xf3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="SRCON1G" edc:nzwidth="32" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1G0" edc:mask="0x1" edc:name="SR1G0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G1" edc:mask="0x1" edc:name="SR1G1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1G6" edc:mask="0x1" edc:name="SR1G6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G7" edc:mask="0x1" edc:name="SR1G7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G8" edc:mask="0x1" edc:name="SR1G8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G9" edc:mask="0x1" edc:name="SR1G9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1G12" edc:mask="0x1" edc:name="SR1G12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G13" edc:mask="0x1" edc:name="SR1G13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G14" edc:mask="0x1" edc:name="SR1G14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G15" edc:mask="0x1" edc:name="SR1G15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8606E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860700" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="--------------------n---n--nn---" edc:cname="ANSELH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff0898" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------1---1--11---" edc:name="ANSELH" edc:nzwidth="0x20" edc:por="--------------------1---1--11---" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSH3" edc:desc="" edc:mask="0x1" edc:name="ANSH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSH4" edc:desc="" edc:mask="0x1" edc:name="ANSH4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSH7" edc:desc="" edc:mask="0x1" edc:name="ANSH7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSH11" edc:desc="" edc:mask="0x1" edc:name="ANSH11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860710" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRISH" edc:desc="" edc:grp="PORTH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111111111111" edc:name="TRISH" edc:nzwidth="0x20" edc:por="----------------1111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISH0" edc:desc="" edc:mask="0x1" edc:name="TRISH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH1" edc:desc="" edc:mask="0x1" edc:name="TRISH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH2" edc:desc="" edc:mask="0x1" edc:name="TRISH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH3" edc:desc="" edc:mask="0x1" edc:name="TRISH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH4" edc:desc="" edc:mask="0x1" edc:name="TRISH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH5" edc:desc="" edc:mask="0x1" edc:name="TRISH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH6" edc:desc="" edc:mask="0x1" edc:name="TRISH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH7" edc:desc="" edc:mask="0x1" edc:name="TRISH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH8" edc:desc="" edc:mask="0x1" edc:name="TRISH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISH9" edc:desc="" edc:mask="0x1" edc:name="TRISH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH10" edc:desc="" edc:mask="0x1" edc:name="TRISH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH11" edc:desc="" edc:mask="0x1" edc:name="TRISH11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISH12" edc:desc="" edc:mask="0x1" edc:name="TRISH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISH13" edc:desc="" edc:mask="0x1" edc:name="TRISH13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISH14" edc:desc="" edc:mask="0x1" edc:name="TRISH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH15" edc:desc="" edc:mask="0x1" edc:name="TRISH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860720" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PORTH" edc:desc="" edc:grp="PORTH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PORTH" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RH0" edc:desc="" edc:mask="0x1" edc:name="RH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH1" edc:desc="" edc:mask="0x1" edc:name="RH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH2" edc:desc="" edc:mask="0x1" edc:name="RH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH3" edc:desc="" edc:mask="0x1" edc:name="RH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH4" edc:desc="" edc:mask="0x1" edc:name="RH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH5" edc:desc="" edc:mask="0x1" edc:name="RH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH6" edc:desc="" edc:mask="0x1" edc:name="RH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH7" edc:desc="" edc:mask="0x1" edc:name="RH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH8" edc:desc="" edc:mask="0x1" edc:name="RH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RH9" edc:desc="" edc:mask="0x1" edc:name="RH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH10" edc:desc="" edc:mask="0x1" edc:name="RH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH11" edc:desc="" edc:mask="0x1" edc:name="RH11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RH12" edc:desc="" edc:mask="0x1" edc:name="RH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RH13" edc:desc="" edc:mask="0x1" edc:name="RH13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RH14" edc:desc="" edc:mask="0x1" edc:name="RH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH15" edc:desc="" edc:mask="0x1" edc:name="RH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860730" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="LATH" edc:desc="" edc:grp="PORTH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="LATH" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATH0" edc:desc="" edc:mask="0x1" edc:name="LATH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH1" edc:desc="" edc:mask="0x1" edc:name="LATH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH2" edc:desc="" edc:mask="0x1" edc:name="LATH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH3" edc:desc="" edc:mask="0x1" edc:name="LATH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH4" edc:desc="" edc:mask="0x1" edc:name="LATH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH5" edc:desc="" edc:mask="0x1" edc:name="LATH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH6" edc:desc="" edc:mask="0x1" edc:name="LATH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH7" edc:desc="" edc:mask="0x1" edc:name="LATH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH8" edc:desc="" edc:mask="0x1" edc:name="LATH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATH9" edc:desc="" edc:mask="0x1" edc:name="LATH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH10" edc:desc="" edc:mask="0x1" edc:name="LATH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH11" edc:desc="" edc:mask="0x1" edc:name="LATH11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATH12" edc:desc="" edc:mask="0x1" edc:name="LATH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATH13" edc:desc="" edc:mask="0x1" edc:name="LATH13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATH14" edc:desc="" edc:mask="0x1" edc:name="LATH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH15" edc:desc="" edc:mask="0x1" edc:name="LATH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860740" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ODCH" edc:desc="" edc:grp="PORTH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ODCH" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCH0" edc:desc="" edc:mask="0x1" edc:name="ODCH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH1" edc:desc="" edc:mask="0x1" edc:name="ODCH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH2" edc:desc="" edc:mask="0x1" edc:name="ODCH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH3" edc:desc="" edc:mask="0x1" edc:name="ODCH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH4" edc:desc="" edc:mask="0x1" edc:name="ODCH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH5" edc:desc="" edc:mask="0x1" edc:name="ODCH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH6" edc:desc="" edc:mask="0x1" edc:name="ODCH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH7" edc:desc="" edc:mask="0x1" edc:name="ODCH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH8" edc:desc="" edc:mask="0x1" edc:name="ODCH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCH9" edc:desc="" edc:mask="0x1" edc:name="ODCH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH10" edc:desc="" edc:mask="0x1" edc:name="ODCH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH11" edc:desc="" edc:mask="0x1" edc:name="ODCH11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCH12" edc:desc="" edc:mask="0x1" edc:name="ODCH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCH13" edc:desc="" edc:mask="0x1" edc:name="ODCH13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCH14" edc:desc="" edc:mask="0x1" edc:name="ODCH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH15" edc:desc="" edc:mask="0x1" edc:name="ODCH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
