Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ1064DAR169.PIC
      <edc:AdjustPoint edc:_addr="0x1F908C34" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F908C38" edc:_begin="0x14" edc:_end="0x18" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="129" edc:access="-------------------------------r" edc:cname="SBT9ECLRM" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT9ECLRM" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908C3C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F908C40" edc:_begin="0x18" edc:_end="0x1c" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="130" edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT9REG0" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT9REG0" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908C44" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F908C50" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="131" edc:access="----------------------------nnnn" edc:cname="SBT9RD0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT9RD0" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908C54" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F908C58" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="132" edc:access="----------------------------nnnn" edc:cname="SBT9WR0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT9WR0" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908C5C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F908C60" edc:_begin="0x18" edc:_end="0x1c" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="133" edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT9REG1" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT9REG1" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908C64" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F908C70" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="134" edc:access="----------------------------nnnn" edc:cname="SBT9RD1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT9RD1" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908C74" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F908C78" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="135" edc:access="----------------------------nnnn" edc:cname="SBT9WR1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT9WR1" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908C7C" edc:offset="932"/>
      <edc:SFRDef edc:_addr="0x1F909020" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="136" edc:access="C---CCCC--------rrrrrrrrrrrr-rrr" edc:cname="SBT10ELOG1" edc:desc="" edc:impl="0x8f00fff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000--------000000000000-000" edc:name="SBT10ELOG1" edc:nzwidth="32" edc:por="0---0000--------000000000000-000" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="" edc:mask="0x7" edc:name="CMD" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="" edc:mask="0xf" edc:name="REGION" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="INITID" edc:desc="" edc:mask="0xff" edc:name="INITID" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CODE" edc:desc="" edc:mask="0xf" edc:name="CODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MULTI" edc:desc="" edc:mask="0x1" edc:name="MULTI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F909024" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="136" edc:access="------------------------------rr" edc:cname="SBT10ELOG2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SBT10ELOG2" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP" edc:desc="" edc:mask="0x3" edc:name="GROUP" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F909028" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="136" edc:access="-------n------------------------" edc:cname="SBT10ECON" edc:desc="" edc:impl="0x1000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0------------------------" edc:name="SBT10ECON" edc:nzwidth="32" edc:por="-------0------------------------" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="ERRP" edc:desc="" edc:mask="0x1" edc:name="ERRP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F90902C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F909030" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="137" edc:access="-------------------------------r" edc:cname="SBT10ECLRS" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT10ECLRS" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F909034" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F909038" edc:_begin="0x14" edc:_end="0x18" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="138" edc:access="-------------------------------r" edc:cname="SBT10ECLRM" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT10ECLRM" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F90903C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F909040" edc:_begin="0x18" edc:_end="0x1c" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="139" edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT10REG0" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT10REG0" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
